# Даны строки S, S1 и S2. Заменить в строке S первое вхождение строки S1 на строку S2.

S = "Hello World, Hello Universe"
S1 = "Hello"
S2 = "Hi"

result = S.replace(S1, S2)
print(result)
